SM_для_EDT/src/Enums/рарусВидыОперацийПриходаТМЦ/рарусВидыОперацийПриходаТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусВидыОперацийПриходаТМЦ</name>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ПриходПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеИзлишков</name>
    <comment>makole ФТ.ИМ.01.01</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПродуктовПитания</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаНавигационныхКарт</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/CommonModules/рарусПриходТМЦ/Module.bsl
Функция ЭтоДокументЗакупки(Приход) Экспорт
	
	Возврат ЭтоОперацияЗакупки(Приход.ВидОперации);
	
КонецФункции

Функция ЭтоДокументЗакупкиЧерезПодотчетноеЛицо(Приход) Экспорт
	
	Возврат ЭтоОперацияЗакупкиЧерезПодотчетноеЛицо(Приход.ВидОперации);
	
КонецФункции

Функция ЭтоДокументПеремещения(Приход) Экспорт
	
	Возврат ЭтоОперацияПеремещения(Приход.ВидОперации);
	
КонецФункции

Функция ЭтоОперацияЗакупки(ВидОперации) Экспорт
	
	Возврат ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаУПоставщика
		// ++ rarus atyutyakin 21.01.2021  [ФТ.ИМ.02.01]
		ИЛИ ЭтоОперацияЗакупкиЧерезПодотчетноеЛицо(ВидОперации)
		ИЛИ ЭтоОперацияЗакупкиПродуктовПитания(ВидОперации)
		ИЛИ ЭтоОперацияЗакупкиНавигационныхКарт(ВидОперации);
		//ИЛИ ЭтоОперацияЗакупкиЧерезПодотчетноеЛицо(ВидОперации);
		// -- rarus atyutyakin 21.01.2021
	
КонецФункции	

Функция ЭтоОперацияЗакупкиЧерезПодотчетноеЛицо(ВидОперации) Экспорт
	
	Возврат ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаЧерезПодотчетноеЛицо;
	
КонецФункции

Функция ЭтоОперацияПеремещения(ВидОперации) Экспорт
	
	Возврат ВидОперации = Перечисления.рарусВидыОперацийПриходаТМЦ.ПриходПоПеремещению;
	
КонецФункции

// ++ rarus atyutyakin 21.01.2021  [ФТ.ИМ.02.01]
Функция ВидОперацииЗакупкаЧерезПодотчетноеЛицо() Экспорт
	
	Возврат Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаЧерезПодотчетноеЛицо;
	
КонецФункции // -- rarus atyutyakin 21.01.2021

// ++ rarus atyutyakin 21.01.2021  [ФТ.ИМ.02.01]
Функция ВидОперацииЗакупкаПродуктовПитания() Экспорт
	
	Возврат Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаПродуктовПитания;
	
КонецФункции // -- rarus atyutyakin 21.01.2021

// ++ rarus atyutyakin 21.01.2021  [ФТ.ИМ.02.01]
Функция ВидОперацииЗакупкаНавигационныхКарт() Экспорт
	
	Возврат Перечисления.рарусВидыОперацийПриходаТМЦ.ЗакупкаНавигационныхКарт;
	
КонецФункции // -- rarus atyutyakin 21.01.2021

// ++ rarus atyutyakin 21.01.2021  [ФТ.ИМ.02.01]
Функция ЭтоОперацияЗакупкиПродуктовПитания(ВидОперации) Экспорт
	
	Возврат ВидОперации = ВидОперацииЗакупкаПродуктовПитания();
	
КонецФункции // -- rarus atyutyakin 21.01.2021

// ++ rarus atyutyakin 21.01.2021  [ФТ.ИМ.02.01]
Функция ЭтоОперацияЗакупкиНавигационныхКарт(ВидОперации) Экспорт
	
	Возврат ВидОперации = ВидОперацииЗакупкаНавигационныхКарт();
	
КонецФункции // -- rarus atyutyakin 21.01.2021

// ++ rarus atyutyakin 12.02.2021  [ФТ.ИМ.02.01]
Функция ЭтоДокументЗакупкиПродуктовПитания(Приход) Экспорт
	
	Возврат ЭтоОперацияЗакупкиПродуктовПитания(Приход.ВидОперации);
	
КонецФункции // -- rarus atyutyakin 12.02.2021

// ++ rarus atyutyakin 12.02.2021  [ФТ.ИМ.02.01]
Функция ЭтоДокументЗакупкиНавигационныхКарт(Приход) Экспорт
	
	Возврат ЭтоОперацияЗакупкиНавигационныхКарт(Приход.ВидОперации);
	
КонецФункции // -- rarus atyutyakin 12.02.2021

// ++ rarus atyutyakin 15.02.2021  [ФТ.ИМ.02.01]
Функция ВидОперацииОприходованиеИзлишков() Экспорт
	
	Возврат Перечисления.рарусВидыОперацийПриходаТМЦ.ОприходованиеИзлишков;
	
КонецФункции // -- rarus atyutyakin 15.02.2021

// ++ rarus atyutyakin 15.02.2021  [ФТ.ИМ.02.01]
// ++ rarus makole 2021-04-23
//Функция ЭтоОперацияОприходованиеИзлишков(ВидОперации) Экспорт
Функция ЭтоОперацияОприходованиеИзлишков(ВидОперации) 
// -- rarus makole 2021-04-23
	
	Возврат ВидОперации = ВидОперацииОприходованиеИзлишков();
	
КонецФункции // -- rarus atyutyakin 15.02.2021

// ++ rarus atyutyakin 12.02.2021  [ФТ.ИМ.02.01]
Функция ЭтоДокументОприходованиеИзлишков(Приход) Экспорт
	
	Возврат ЭтоОперацияОприходованиеИзлишков(Приход.ВидОперации);
	
КонецФункции // -- rarus atyutyakin 12.02.2021

// ++ rarus atyutyakin 12.02.2021  [ФТ.ИМ.02.01]
Функция ЭтоДокументОприходованиеИзлишковБывшегоВУпотреблении(Приход) Экспорт
	
	Возврат ЭтоОперацияОприходованиеИзлишков(Приход.ВидОперации) И Приход.ОприходованиеБывшегоВУпотреблении;
	
КонецФункции // -- rarus atyutyakin 12.02.2021
